[{"id":"eb34e684-3f19-4ab6-b67d-999894b201f3","created":1603828420018,"last_edited":1603924080000,"slug":"test","type":"post","title":"Post 1","date":"2020-10-27","published":true,"body":"<h1>This is a test 😂</h1><p>My Page</p><p>1</p><p>2</p><p>3</p><pre><code class=\"language-javascript\">print <span class=\"token string\">'hi'</span><span class=\"token punctuation\">;</span></code></pre>","_id":"fc6d0f4617d340beb46a5a684044f5c1"},{"id":"b2ea2e93-ddab-4ef4-8afc-3939c13fe4cd","created":1603903860000,"last_edited":1604079180000,"slug":"post-2","type":"post","title":"Post 2","date":"2020-10-28","published":true,"body":"<p>Test post 2</p><p>😂</p><ul><li>1</li><li>2</li><li>3</li><li>5</li></ul>","_id":"21eca532f24c4d198825ba8e4b079233"},{"id":"7160e2a5-7fbb-4788-8554-9da9d4905caa","created":1604079240000,"last_edited":1604079240000,"slug":"post-3","type":"post","title":"Post 3","date":"2020-10-30","published":true,"body":"<p>🙂</p>","_id":"c4534e812fb14a3dbd3e61aa0a0b2daa"},{"id":"835fff10-5279-478b-b362-5a1d9871f3ac","created":1603923960000,"last_edited":1603927860000,"slug":"about","type":"page","title":"About","body":"<h1>Contact</h1><p>Hi, I’m Elijah Cornell. I run 8-BitMage Software. Nice to meet you.</p><h1>Customers</h1><p>Technical support is not available, but I welcome your feedback. To help me handle it all, please direct it properly:</p><ul><li><a href=\"https://web.archive.org/web/20191019094300/https://twitter.com/8bitmage\">@8bitmage</a> on Twitter for quick comments (if you use Twitter).</li><li><a href=\"mailto:feedback@8bitmage.com\">feedback@8bitmage.com</a> for feedback and suggestions.</li></ul><p><strong>I will try to read and consider every tweet and email, but I can’t respond to them all.</strong> I wish I could, but I can’t. (That’s life.) Thanks for understanding.</p><h1>Press and ad sales</h1><ul><li><a href=\"mailto:business@8bitmage.com\">business@8bitmage.com</a> for in-app advertising and press inquiries. No soliciting, please.</li></ul>","_id":"85b8cbb2bd6d4dad86e97d61f87f5101"},{"id":"e5653fc1-3f3c-4c95-bea5-a863b34c0d1b","created":1603923900000,"last_edited":1603927860000,"slug":"privacy-policy","type":"page","title":"Privacy Policy","body":"<h1>Privacy Policy</h1><p>This policy applies to all information collected or submitted on 8BitMage website and our mobile apps for iOS and any other devices and platforms.</p><h1>History of changes</h1><ol><li><strong>February 23, 2017</strong>: First published.</li></ol><h1>Information we collect</h1><p>When creating an account, you will be asked to enter an optional email address and a password. Email addresses are <strong>only</strong> used for logging in and password resets. We don’t send promotional emails.</p><p>If you enable notifications, we must store a token to send them. We <strong>never</strong> use notifications for marketing.</p><p>We use cookies on the site and similar tokens in the app to keep you logged in.</p><p>Like most websites and apps, we also store information through the use of software that may be transparent to users. For example, we may log your IP address and general information about your browser or device.</p><h1>In-app analytics</h1><p>Our mobile apps collects aggregate, anonymous statistics, such as the percentage of users who use particular features, to improve the app and prioritize future development efforts. Crash reports are also collected to help improve the app.</p><h1>In-app ads</h1><p>Our mobile apps includes ads for non-Premium users. No personal data is used to target these ads.</p><p>The only data collected by each ad is the number of times it has been viewed and tapped.</p><h1>Information usage</h1><p>We use the information we collect to operate and improve our website, apps, and customer support.</p><p>We do not share your personal information with outside parties except to the extent necessary to accomplish application functionality.</p><p>We may share anonymous, aggregate statistics with outside parties, such as:</p><p>The number of views, taps, and subscriptions resulting from in-app ads. We may disclose your information in response to subpoenas, court orders, or other legal requirements; to exercise our legal rights or defend against legal claims; to investigate, prevent, or take action regarding illegal activities, suspected fraud or abuse, violations of our policies; or to protect our rights and property.</p><p>In the future, we may sell to, buy, merge with, or partner with other businesses. In such transactions, user information may be among the transferred assets.</p><h1>Security</h1><p>We implement a variety of security measures to help keep your information secure.</p><p>For instance, all communication with the app and website requires HTTPS, and passwords are not stored: they are hashed using advanced, well-researched methods. (At the time of writing, bcrypt is used, but that may be upgraded to a more advanced algorithm in the future such as scrypt without notice.)</p><h1>Accessing your information</h1><p>You may access or change your information or delete your account at any time from the app.</p><h1>California Online Privacy Protection Act Compliance</h1><p>We comply with the California Online Privacy Protection Act. We therefore will not distribute your personal information to outside parties without your consent.</p><h1>Children’s Online Privacy Protection Act Compliance</h1><p>We never collect or maintain information at our website from those we actually know are under 13, and no part of our website is structured to attract anyone under 13.</p><h1>Your Consent</h1><p>By using our site or apps, you consent to our privacy policy.</p><h1>Contacting Us</h1><p>If you have questions regarding this privacy policy, you may email 8bitmage-apps@gmail.com.</p><h1>Changes to this policy</h1><p>If we decide to change our privacy policy, we will post those changes on this page and update the Privacy Policy history above.</p>","_id":"aa16c47e5d424a8f9cb98ced9564615c"}]